#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2193                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: seoyoung7623 <boj.kr/u/seoyoung7623>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2193                           #+#        #+#      #+#     #
#    Solved: 2025/08/08 19:46:26 by seoyoung7623  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
'''
끝나는 지점을 기준으로 피보나치 수열이다!
끝이 0 or 1로 끝나야하는데
1의 경우 11 중복이 안되기때문에 1앞에 꼭 0이 있어야함. 따라서 길이가 2자리 짧은 f(n-2)를 추가하면 되는것!
0,01로 끝나는 경우를 찾는다
'''
N = int(input())
dp = [0]*91
dp[1]=1
dp[2]=1

for i in range(3,N+1):
    dp[i] = dp[i-2]+dp[i-1]
print(dp[N])
