#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 11004                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: seoyoung7623 <boj.kr/u/seoyoung7623>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/11004                          #+#        #+#      #+#     #
#    Solved: 2025/03/23 00:03:45 by seoyoung7623  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
N,K = map(int,input().split())
arr = list(map(int,input().split()))
arr.sort()

print(arr[K-1])
'''
sort()가 O(N log N)인 이유는?
데이터를 반씩 나누면서 정렬(→ log N), 각 단계에서 병합(→ N)
'''