#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 12904                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: seoyoung7623 <boj.kr/u/seoyoung7623>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/12904                          #+#        #+#      #+#     #
#    Solved: 2025/03/19 18:35:31 by seoyoung7623  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
'''
문자열
출력 가능,불가능

내 접근: 백트래킹
접근법: 거꾸로 접근

끝까지 예시를 따라해보자,,,
'''
S = input()
T = input()
answer = 0

while len(T)>= len(S):
    if T == S:
        answer = 1
        break
    if T[-1] == 'A':
        T = T[0:-1]
    elif T[-1] == 'B':
        T = T[0:-1]
        T = T[::-1]

print(answer)

    
    

