#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 1038                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: seoyoung7623 <boj.kr/u/seoyoung7623>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/1038                           #+#        #+#      #+#     #
#    Solved: 2025/04/16 09:44:09 by seoyoung7623  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
'''
감소하는 수
N번째 수
abc
백트레킹: 조합을 만들때처럼 수를 백트래킹할수있다.
'''
N = int(input())

def backtracking(cnt,lst):
    if cnt == N:
        return
    
    
