#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 3460                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: seoyoung7623 <boj.kr/u/seoyoung7623>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/3460                           #+#        #+#      #+#     #
#    Solved: 2025/04/02 09:35:28 by seoyoung7623  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
'''
이진수 1의 위치
1101
이진수 계산하기
bin(10진수) -> 10진수를 2진수로 변환 13을 0b1101 이런 형식으로 변환
따라서[2:]로 처리할 수 있음
'''
T = int(input())
for test_case in range(T):
    n = int(input())
    lst = []
    while 1:
        if n == 1:
            lst.append(1)
            break
        lst.append(n % 2)
        n //= 2

    for i in range(len(lst)):
        if lst[i] == 1:
            print(i,end=' ')
        
        
        
