#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2504                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: seoyoung7623 <boj.kr/u/seoyoung7623>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2504                           #+#        #+#      #+#     #
#    Solved: 2025/04/02 09:49:01 by seoyoung7623  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
'''
괄호의 값
스택을 이용
올바른 괄호
올바르지 않은 괄호
'''
arr = list(input())
stack = []

for i in arr:
    if i == '(':
        stack.append()
    elif i == '[':
    elif i == ')':
    elif i ==']':