#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 15989                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: seoyoung7623 <boj.kr/u/seoyoung7623>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/15989                          #+#        #+#      #+#     #
#    Solved: 2025/04/17 12:19:57 by seoyoung7623  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
'''
123의 합으로 나타내는 수
DP인것 같은데 겹치는거 어떻게 처리하지
하나의 점화식으로 처리될 필요없음 누적합처럼 리스트를 또 업데이트 할 수있다.
'''
T = int(input())
dp = [1]*10001 # 1로만 만드는 수는 1개씩 존재함

for i in range(2,10001):
    dp[i] += dp[i-2]

for i in range(3,10001):
    dp[i] += dp[i-3]

for test_case in range(T):
    answer = int(input())
    print(dp[answer])