#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 11052                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: seoyoung7623 <boj.kr/u/seoyoung7623>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/11052                          #+#        #+#      #+#     #
#    Solved: 2025/08/08 20:21:22 by seoyoung7623  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
'''
카드 구매 최대값구하기
1. i장을 그대로 사는 경우
2. i-j / j장 사는 경우
    i-j는 이미 최적이기때문에 j를 더한것도 최적이다 -> 최적 부분 구조

'''
N = int(input())
list = list(map(int,input().split()))
dp = [0]*(N+1)
dp[1] = list[0]

for i in range(1,N+1):
    for j in range(1,i):
        dp[i] = max(dp[i-j]+dp[j],list[i-1],dp[i])
print(max(dp))